from colorama import Fore, Back, Style




print(Fore.CYAN + "Приветики пистолетики ,_, ")
name = input(Fore.CYAN+"Давай знакомиться, тебя как звать?: ")
print(Fore.RED+"Честно хз че можно сделать в этой прогe\n Поэтому я загружу тебе бэкдор,надеюсь ты не против.")
otvet = str(input(Fore.YELLOW+"Ответ дай в виде Y/N: "))

if otvet =="Y":
	print(Back.RESET+"Жми любую кнопку для продолжения")
	print("Ой, а загрузка уже пошла, нажми кнопку любую для того чтобы увидеть лог")

elif otvet =="y":
	print(Back.RED+"Жми любую кнопку для продолжения"+ Fore.BLACK)
	print("Ой, а загрузка уже пошла, нажми кнопку любую для того чтобы увидеть лог")
	input()

elif otvet == "N":
	print("Я другого ответа и не ожидал")
	print("Загрузка уже в процессе %")
elif otvet =="y":
	print("Жми любую кнопку для продолжения")
	print("Ой, а загрузка уже пошла, нажми кнопку любую для того чтобы увидеть лог")
else:
	print("Ты буквы различаешь?")
input()
x = 1
while x <100:
	x = x+1
	print(Fore.RED+ "\nЗагруженно", x ,"%")
print("\nКак видишь все успешно загруженно ._.")
input("\n\nА зачем тебе порно в тг????")
print(Fore.RED+"\n\n!Отвравлю все 173826 видео маме!!!!!")
input()
v= 0
while v<173826: 
	v= v+2
	print("\nОтправлено",v,"видео")
	
print("\nСпасибо за логи в вк")
input()

	
